<template>
  <div class="wrapper">
    <userinfo-header title="商城用户注册协议" oper=''></userinfo-header>
    <div class="agreementCon">
      <span>本协议是您与商城网站（简称"本站"，网址：<a href="https://www.upinstar.com/">https://www.upinstar.com/</a>）所有者（以下简称为"商城"）之间就商城网站服务等相关事宜所订立的契约，请您仔细阅读本注册协议，您点击"同意并继续"按钮后，本协议即构成对双方有约束力的法律文件。</span>
      <h3>第1条 本站服务条款的确认和接纳</h3>
      <span>1.1本站的各项电子服务的所有权和运作权归商城所有。用户同意所有注册协议条款并完成注册程序，才能成为本站的正式用户。用户确认：本协议条款是处理双方权利义务的契约，始终有效，法律另有强制性规定或双方另有特别约定的，依其规定。</span>
      <span>1.2用户点击同意本协议的，即视为用户确认自己具有享受本站服务、下单购物等相应的权利能力和行为能力，能够独立承担法律责任。</span>
      <span>1.3如果您在18周岁以下，您只能在父母或监护人的监护参与下才能使用本站。</span>
      <span>1.4商城保留在中华人民共和国大陆地区法施行之法律允许的范围内独自决定拒绝服务、关闭用户账户、清除或编辑内容或取消订单的权利。</span>
      <h3>第2条 本站服务</h3>
      <span>2.1商城通过互联网依法为用户提供互联网信息等服务，用户在完全同意本协议及本站规定的情况下，方有权使用本站的相关服务.</span>
      <span>2.2用户必须自行准备如下设备和承担如下开支：</span>
      <span>（1）上网设备，包括并不限于电脑或者其他上网终端、调制解调器及其他必备的上网装置；</span>
      <span>（2）上网开支，包括并不限于网络接入费、上网设备租用费、手机流量费等。</span>
      <h3>第3条 用户信息</h3>
      <span>3.1用户应自行诚信向本站提供注册资料，用户同意其提供的注册资料真实、准确、完整、合法有效，用户注册资料如有变动的，应及时更新其注册资料。如果用户提供的注册资料不合法、不真实、不准确、不详尽的，用户需承担因此引起的相应责任及后果，并且商城保留终止用户使用商城各项服务的权利。</span>
      <span>3.2用户在本站进行浏览、下单购物等活动时，涉及用户真实姓名/名称、通信地址、联系电话、电子邮箱等隐私信息的，本站将予以严格保密，除非得到用户的授权或法律另有规定，本站不会向外界披露用户隐私信息。</span>
      <span>3.3用户注册成功后，将产生用户名和密码等账户信息，您可以根据本站规定改变您的密码。。请您对密码加以妥善保管，切勿将密码告知他人，因密码保管不善而造成的所有损失由您自行承担.用户若发现任何非法使用用户账号或存在安全漏洞的情况，请立即通知本站并向公安机关报案。</span>
      <span>3.4用户同意，商城拥有通过邮件、短信电话等形式，向在本站注册、购物用户、收货人发送订单信息、促销活动等告知信息的权利。</span>
      <span>3.5用户不得将在本站注册获得的账户借给他人使用，否则用户应承担由此产生的全部责任，并与实际使用人承担连带责任。</span>
      <span>3.6用户同意，商城有权使用用户的注册信息、用户名、密码等信息，登录进入用户的注册账户，进行证据保全，包括但不限于公证、见证等。</span>
      <h3>第4条 用户依法言行义务</h3>
      <span>本协议依据国家相关法律法规规章制定，用户同意严格遵守以下义务：</span>
      <span>（1）不得传输或发表、煽动抗拒、破坏宪法和法律、行政法规实施的言论，煽动颠覆国家政权，推翻社会主义制度的言论，煽动分裂国家、破坏国家统一的的言论，煽动民族仇恨、民族歧视、破坏民族团结的言论；</span>
      <span>（2）从中国大陆向境外传输资料信息时必须符合中国有关法规；</span>
      <span>（3）不得利用本站从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动；</span>
      <span>（4）不得干扰本站的正常运转，不得侵入本站及国家计算机信息系统；</span>
      <span>（5）不得传输或发表任何违法犯罪的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的，淫秽的、不文明的等信息资料；</span>
      <span>（6）不得传输或发表损害国家社会公共利益和涉及国家安全的信息资料或言论；</span>
      <span>（7）不得教唆他人从事本条所禁止的行为；</span>
      <span>（8）不得利用在本站注册的账户进行牟利性经营活动；</span>
      <span>（9）不得发布任何侵犯他人著作权、商标权等知识产权或合法权利的内容；</span>
      <span>用户应不时关注并遵守本站不时公布或修改的各类合法规则规定.</span>
      <span>本站保有删除站内各类不符合法律政策或不真实的信息内容而无须通知用户的权利。</span>
      <span>若用户未遵守以上规定的，本站有权作出独立判断并采取暂停或关闭用户帐号等措施。用户须对自己在网上的言论和行为承担法律责任。</span>
      <h3>第5条 商品信息</h3>
      <span>本站上的商品价格、数量、是否有货等商品信息随时都有可能发生变动，本站不作特别通知。由于网站上商品信息的数量极其庞大，虽然本站会尽最大努力保证您所浏览商品信息的准确性，但由于众所周知的互联网技术因素等客观原因存在，本站网页显示的信息可能会有一定的滞后性或差错，对此情形您知悉并理解，如您对商品信息有所疑问，请在第一时间联系，并中止提交该订单。商城欢迎纠错，并会视情况给予纠错者一定的奖励。</span>
    </div>
  </div>
</template>
<script>
import UserinfoHeader from './components/ComUserSetHeader'
export default {
  name: 'agreement',
  data () {
    return {

    }
  },
  components: {
    UserinfoHeader
  }
}
</script>

<style lang="stylus" ecoped>
  body,html
    background #fff
  .wrapper
    width 100%
    box-sizing border-box
    padding-top 130px
  .agreementCon
    width calc(100% - 100px)
    margin 0 auto
    box-sizing border-box
    padding 50px 0 100px
    background #fff
    span
      display block
      width 100%
      line-height 66px
      font-size 36px
      color #262626
    h3
      width 100%
      line-height 70px
      font-size 46px
      color #000
      margin 80px 0 20px
      font-weight bold
</style>
